# Exercício

**Arquivo Exercicio_Pandas_1.csv**
1. Carregue um arquivo CSV contendo dados de uma planilha e crie um DataFrame com o Pandas.
   
2. Exiba as primeiras linhas do DataFrame para verificar os dados que foram carregados.
3. Verifique o número de linhas e colunas presentes no DataFrame.
4. Utilize o método `info()` para obter informações sobre os tipos de dados e a contagem de valores não nulos em cada coluna.
5. Selecione uma coluna específica do DataFrame e exiba suas estatísticas básicas usando o método `describe()`.
6. Faça uma filtragem no DataFrame para exibir apenas as linhas que atendam a determinada condição.
7. Crie uma nova coluna no DataFrame, calculando-a com base em outras colunas existentes.
8. Agrupe o DataFrame com base em uma coluna específica e realize uma operação de agregação, como soma, média ou contagem.
9.  Utilize a função `apply()` para aplicar uma função personalizada a uma coluna ou linha do DataFrame.
10. Faça uma ordenação dos dados em ordem crescente ou decrescente com base em uma coluna específica.
11. Utilize o recurso de indexação booleana para filtrar o DataFrame com base em várias condições.
    
**Arquivo Exercicio_Pandas_2.json**
1.  Carregue um conjunto de dados complexo (por exemplo, de um arquivo JSON ou um banco de dados SQL) e crie um DataFrame usando o Pandas.
   
2.  Utilize técnicas de indexação avançada para selecionar, filtrar e modificar dados em um DataFrame.
   
**Arquivos Exercicio_Pandas_2.json e Exercicio_Pandas_3.csv**
1.  Combine dois DataFrames usando operações de junção (merge) ou concatenação.
   
2.  Utilize o método `groupby()` para agrupar os dados por múltiplas colunas e realizar operações de agregação em grupos.

In [3]:
import pandas as pd

In [4]:
# 1. Carregue um arquivo CSV contendo dados de uma planilha e crie um DataFrame com o Pandas.
# 2. Exiba as primeiras linhas do DataFrame para verificar os dados que foram carregados.
df = pd.read_csv('../../Datasets/Exercicio_Pandas_1.csv', sep = '\t')
df.head()

    Nome  Idade          Cidade
0  Alice     25       São Paulo
1    Bob     30  Rio de Janeiro
2  Carol     22  Belo Horizonte
3  David     27        Salvador
4    Eva     68    Porto Alegre

In [5]:
# 3. Verifique o número de linhas e colunas presentes no DataFrame.
df.shape

(5, 3)

In [6]:
# 4. Utilize o método `info()` para obter informações sobre os tipos de dados e a contagem de valores não nulos em cada coluna.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Nome    5 non-null      object
 1   Idade   5 non-null      int64
 2   Cidade  5 non-null      object
dtypes: int64(1), object(2)
memory usage: 248.0+ bytes

In [7]:
# 5. Selecione uma coluna específica do DataFrame e exiba suas estatísticas básicas usando o método `describe()`.
df['Idade'].describe()

count     5.000000
mean     34.400000
std      19.007893
min      22.000000
25%      25.000000
50%      27.000000
75%      30.000000
max      68.000000
Name: Idade, dtype: float64

In [8]:
# 6. Faça uma filtragem no DataFrame para exibir apenas as linhas que atendam a determinada condição.
filtro = df['Idade'] >= 25
df[filtro]

    Nome  Idade          Cidade
0  Alice     25       São Paulo
1    Bob     30  Rio de Janeiro
3  David     27        Salvador
4    Eva     68    Porto Alegre

In [9]:
# 7. Crie uma nova coluna no DataFrame, calculando-a com base em outras colunas existentes.
df['Ano_Nascimento'] = 2023 - df['Idade']
df

    Nome  Idade          Cidade  Ano_Nascimento
0  Alice     25       São Paulo            1998
1    Bob     30  Rio de Janeiro            1993
2  Carol     22  Belo Horizonte            2001
3  David     27        Salvador            1996
4    Eva     68    Porto Alegre            1955

In [10]:
# 8. Agrupe o DataFrame com base em uma coluna específica e realize uma operação de agregação, como soma, média ou contagem.
grupo_cidade = df.groupby('Cidade')['Idade'].mean()
grupo_cidade

Cidade
Belo Horizonte    22.0
Porto Alegre      68.0
Rio de Janeiro    30.0
Salvador          27.0
São Paulo         25.0
Name: Idade, dtype: float64

In [11]:
# 9.  Utilize a função `apply()` para aplicar uma função personalizada a uma coluna ou linha do DataFrame.
def classificar_idade(idade):
    if idade < 25:
        return 'Jovem'
    elif idade < 60:
        return 'Adulto'
    else:
        return 'Idoso'

df['Classificacao'] = df['Idade'].apply(classificar_idade)
df

    Nome  Idade          Cidade  Ano_Nascimento Classificacao
0  Alice     25       São Paulo            1998        Adulto
1    Bob     30  Rio de Janeiro            1993        Adulto
2  Carol     22  Belo Horizonte            2001         Jovem
3  David     27        Salvador            1996        Adulto
4    Eva     68    Porto Alegre            1955         Idoso

In [12]:
# 10. Faça uma ordenação dos dados em ordem crescente ou decrescente com base em uma coluna específica.
df_sorted = df.sort_values(by='Idade', ascending=True)
df_sorted

    Nome  Idade          Cidade  Ano_Nascimento Classificacao
2  Carol     22  Belo Horizonte            2001         Jovem
0  Alice     25       São Paulo            1998        Adulto
3  David     27        Salvador            1996        Adulto
1    Bob     30  Rio de Janeiro            1993        Adulto
4    Eva     68    Porto Alegre            1955         Idoso

In [13]:
# 11. Utilize o recurso de indexação booleana para filtrar o DataFrame com base em várias condições.
filtro = (df['Idade'] >= 25) & (df['Cidade'] == 'São Paulo')
df_filtrado = df[filtro]
df_filtrado

    Nome  Idade     Cidade  Ano_Nascimento Classificacao
0  Alice     25  São Paulo            1998        Adulto

In [14]:
# **Arquivo Exercicio_Pandas_2.json**
# 1.  Carregue um conjunto de dados complexo (por exemplo, de um arquivo JSON ou um banco de dados SQL) e crie um DataFrame usando o Pandas.

df_json = pd.read_json('../../Datasets/Exercicio_Pandas_2.json')
df_json

     Produto  Quantidade_Vendida  Valor_Unitario  Valor_Total
0    Celular                 100            1000       100000
1         TV                  50            2000       100000
2   Notebook                  70            2500       175000
3     Tablet                  30             800        24000
4  Headphone                  80             150        12000

In [15]:
# 2.  Utilize técnicas de indexação avançada para selecionar, filtrar e modificar dados em um DataFrame.
df_json.loc[df_json['Quantidade_Vendida'] > 50, 'Produto'] = 'Celular'
df_json

   Produto  Quantidade_Vendida  Valor_Unitario  Valor_Total
0  Celular                 100            1000       100000
1       TV                  50            2000       100000
2  Celular                  70            2500       175000
3   Tablet                  30             800        24000
4  Celular                  80             150        12000

In [16]:
# **Arquivos Exercicio_Pandas_2.json e Exercicio_Pandas_3.csv**
# 1.  Combine dois DataFrames usando operações de junção (merge) ou concatenação.
df_json = pd.read_json('../../Datasets/Exercicio_Pandas_2.json')
df_csv = pd.read_csv('../../Datasets/Exercicio_Pandas_3.csv', sep = '\t')

df_concatenado = pd.concat([df_json, df_csv], ignore_index=True)
df_concatenado

     Produto  Quantidade_Vendida  Valor_Unitario  Valor_Total
0    Celular                 100            1000       100000
1         TV                  50            2000       100000
2   Notebook                  70            2500       175000
3     Tablet                  30             800        24000
4  Headphone                  80             150        12000
5      Mouse                  60              50         3000
6    Teclado                  40             100         4000

In [19]:
# 2.  Utilize o método `groupby()` para agrupar os dados por múltiplas colunas e realizar operações de agregação em grupos.
grupo = df_concatenado.groupby(['Produto', 'Valor_Unitario'])['Valor_Total'].mean()
grupo

Produto    Valor_Unitario
Celular    1000              100000.0
Headphone  150                12000.0
Mouse      50                  3000.0
Notebook   2500              175000.0
TV         2000              100000.0
Tablet     800                24000.0
Teclado    100                 4000.0
Name: Valor_Total, dtype: float64